Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: There is an extra backslash before the first colon, so that it's included in the ":set" command. The text after the second colon is ignored, thus a remark can be placed there.
es_es: Hay una barra inversa extra antes del primer colon, y por ello se incluye en la orden «:set». Se ignora el texto antes del segundo colon, y por ello puede introducir aquí un comentario.

source: *usr_29.txt* For Vim version 7.3. Last change: 2008 Jun 28
es_es: *usr_29.esx* Para Vim versión 7.3. Último cambio: 8/6/2008

source: Moving through programs
es_es: Moverse a través de programas

source: The creator of Vim is a computer programmer. It's no surprise that Vim contains many features to aid in writing programs. Jump around to find where identifiers are defined and used. Preview declarations in a separate window. There is more in the next chapter.
es_es: El creador de Vim es un programador informático. Por ello, no sorprende que Vim integre tantas características que facilitan la edición de programas. Salte de un punto a otro para ver dónde se definen y usan los identificadores. Previsualize declaraciones en una ventana distinta. Hay aún más en el siguiente capítulo.

source: |29.1| Using tags |29.2| The preview window |29.3| Moving through a program |29.4| Finding global identifiers |29.5| Finding local identifiers
es_es: |29.1| Usar etiquetas |29.2| La ventana de vista previa |29.3| Moverse a través de un programa |29.4| Buscar identificadores globales |29.5| Buscar identificadores locales

source: Next chapter: |usr_30.txt| Editing programs Previous chapter: |usr_28.txt| Folding Table of contents: |usr_toc.txt|
es_es: Siguiente capítulo: |usr_30.txt| Editar programas Capítulo anterior: |usr_28.esx| Plegado Tabla de contenidos: |usr_toc.esx|

source: *29.1* Using tags
es_es: *29.1* Usar etiquetas

source: :tags # TO tag FROM line in file/text ~ 1 1 write_line 8 write_block.c ~ 2 1 write_char 7 write_line.c ~ > ~ > Now to go back. The CTRL-T command goes to the preceding tag. In the example above you get back to the "write_line" function, in the call to "write_char". This command takes a count argument that indicates how many tags to jump back. You have gone forward, and now back. Let's go forward again. The following command goes to the tag on top of the list: >
es_es: :tags # TO tag FROM line in file/text ~ 1 1 write_line 8 write_block.c ~ 2 1 write_char 7 write_line.c ~ > ~ > Vuelva atrás ahora. La orden «CTRL-T» se desplaza a la etiqueta precedente. En el ejemplo anterior, vuelve a la función «write_line» al invocar «write_char». Esta orden toma un argumento numérico que indica el número de etiquetas que se desplazará hacia atrás. Ahora que ha ido hacia delante, vuelva atrás. Vayamos otra vez hacia delante. La siguiente orden se desplaza a la etiqueta al principio de la lista: >

source: You can prefix it with a count and jump forward that many tags. For example: ":3tag". CTRL-T also can be preceded with a count. These commands thus allow you to go down a call tree with CTRL-] and back up again with CTRL-T. Use ":tags" to find out where you are.
es_es: Puede precederlo de un número para saltar hacia delante ese número d etiquetas. Por ejemplo: «:3tag». También puede preceder «CTRL-T» con un número. Por ello, estas órdenes permiten desplazarse hacia delante con «CTRL-]», y hacia atrás con «CTRL-T». Use «:tags» conocer dónde se encuentra.

source: The ":tag" command replaces the file in the current window with the one containing the new function. But suppose you want to see not only the old function but also the new one? You can split the window using the ":split" command followed by the ":tag" command. Vim has a shorthand command that does both: > :stag tagname
es_es: La orden «:tag» reemplaza el fichero en la ventana actual con el que contiene la nueva función. Pero suponga que desea ver no sólo la función antigua, y no sólo la nueva. Para ello, puede dividir la ventana usando la orden «:split», seguida de la orden «:tag». Vim tiene una orden corta que realiza ambas funciones: > :stag tagname

source: When you have files in many directories, you can create a tags file in each of them. Vim will then only be able to jump to tags within that directory. To find more tags files, set the 'tags' option to include all the relevant tags files. Example: >
es_es: Cuando tiene varios ficheros en muchos directorios, puede crear un fichero de etiquetas en cada uno de ellos. Vim sólo podrá saltar a etiquetas dentro de ese directorio. Para encontrar más ficheros de etiquetas, defina la opción 'tags' para incluir todos los ficheros de etiquetas relevantes. Ejemplo: >

source: This finds a tags file in the same directory as the current file, one directory level higher and in all subdirectories. This is quite a number of tags files, but it may still not be enough. For example, when editing a file in "~/proj/src", you will not find the tags file "~/proj/sub/tags". For this situation Vim offers to search a whole directory tree for tags files. Example: >
es_es: Esto encuentra un fichero de etiquetas en el mismo directorio que el fichero actual, un nivel de directorios superiores y en todos los subdirectorios. Este es un alto número de ficheros de etiquetas, pero puede que no lo suficiente. Por ejemplo, al editar un fichero en «~/proj/src», no encontraría el fichero de etiquetas «~/proj/sub/tags». Por ello, Vim ofrece buscar ficheros de etiquetas en todo el árbol de directorios. Ejemplo: >

source: The nice thing about this is that Exuberant ctags recognizes various file types. Thus this doesn't work just for C and C++ programs, also for Eiffel and even Vim scripts. See the ctags documentation to tune this. Now you only need to tell Vim where your big tags file is: >
es_es: Lo mejor de esto es que Exuberant ctags reconoce varios tipos de fichero. Por ello, no sólo funciona con programas de C y C++, sino también para Eiffel e incluso scripts de Vim. Consulte la documentación de ctags para información de configuración. Ahora sólo tiene que decir a Vim dónde está su fichero grande de etiquetas: >

source: When a function is defined multiple times (or a method in several classes), the ":tag" command will jump to the first one. If there is a match in the current file, that one is used first. You can now jump to other matches for the same tag with: >
es_es: Cuando una función se define varias veces (o un mismo método en varias clases), la orden «:tag» saltaría a la primera aparición. De haber una coincidencia en el fichero actual, se usará éste en primer lugar. Ahora puede saltar a otras coincidencias de la misma etiqueta con: >

source: Repeat this to find further matches. If there are many, you can select which one to jump to: >
es_es: Repita para encontrar más coincidencias. De haber varias, puede seleccionar a cuál saltar: >

source: :tselect tagname
es_es: :tselect etiqueta

source: You can now enter the number (in the first column) of the match that you would like to jump to. The information in the other columns give you a good idea of where the match is defined.
es_es: Ahora puede introducir el número (en la primera columna) de la coincidencia a la que desea saltar. La información en las otras columnas le dan un buena idea de dónde se define la coincidencia.

source: :tfirst go to first match :[count]tprevious go to [count] previous match :[count]tnext go to [count] next match :tlast go to last match
es_es: :tfirst Primera coincidencia :[número]tprevious Ir a la [número] coincidencia anterior :[count]tnext Ir a la [número] coincidencia siguiente :tlast Ir a la última coincidencia

source: Command line completion is a good way to avoid typing a long tag name. Just type the first bit and press <Tab>: >
es_es: El autocompletado de línea de órdenes es una buena manera de evitar escribir un nombre de etiqueta largo. Simplemente escriba la primera parte y pulse <Tab>: >

source: Now use command line completion: press <Tab>. Vim will find all tags that contain "block" and use the first match. The "/" before a tag name tells Vim that what follows is not a literal tag name, but a pattern. You can use all the items for search patterns here. For example, suppose you want to select a tag that starts with "write_": >
es_es: Use ahora el autocompletado de línea de órdenes pulsando <Tab>. Vim encontrará todas las etiquetas que contienen «block», y usará la primera coincidencia. La «/» antes del nombre de una etiqueta le dice a Vim que lo hay a continuación no es un nombre de etiqueta, sino un patrón. Puede usar todos los elementos de patrones de búsqueda. Por ejemplo, supongo que desea seleccionar una etiqueta que empieza con «write»: >

source: The "^" specifies that the tag starts with "write_". Otherwise it would also be found halfway a tag name. Similarly "$" at the end makes sure the pattern matches until the end of a tag.
es_es: La «^» especifica que la etiqueta empieza con «write_». En caso contrario, se detectaría también de estar en medio de un nombre de etiqueta. De forma similar, el signo «$» al final asegura que el patrón sólo coincida con el final de una etiqueta.

source: Since CTRL-] takes you to the definition of the identifier under the cursor, you can use a list of identifier names as a table of contents. Here is an example. First create a list of identifiers (this requires Exuberant ctags): >
es_es: Ya que «CTRL-]» le lleva a la definición del identificador bajo el cursor, puede usar un alista de nombres identificadores como una tabla de contenidos. Aquí tiene un ejemplo. Primero cree una lista de identificadores (require Exuberant ctags): >

source: The window contains a list of all the functions. There is some more stuff, but you can ignore that. Do ":setlocal ts=99" to clean it up a bit. In this window, define a mapping: >
es_es: Esta ventana contiene todas una lista de todas las funciones. También hay más elementos, pero los puede ignorar. Ejecute «setlocal ts=99» para organizarlo un poco. Defina una macro en esta ventana: >

source: The 'tagbsearch' option tells if the tags file is sorted or not. The default is to assume a sorted tags file, which makes a tags search a lot faster, but doesn't work if the tags file isn't sorted.
es_es: La opción 'tagbsearch' indica si el archivo de etiquetas está ordenado o no. El valor predeterminado es suponer un archivo de etiquetas ordenado, que agiliza la búsqueda de etiquetas, pero no funciona si el archivo de etiquetas no está ordenado.

source: When you use the SNiFF+ program, you can use the Vim interface to it |sniff|. SNiFF+ is a commercial program.
es_es: Cuando usa el programa SNiFF+, puede usar la interfaz de Vim |sniff|. SNiFF+ es un programa comercial.

source: Cscope is a free program. It does not only find places where an identifier is declared, but also where it is used. See |cscope|.
es_es: Cscope es un programa libre. No sólo encuentra los lugares dónde se declara un identificador. sino también dónde se usa. Consulte |cscope|.

source: *29.2* The preview window
es_es: *29.2* La ventana de previsualización

source: When you edit code that contains a function call, you need to use the correct arguments. To know what values to pass you can look at how the function is defined. The tags mechanism works very well for this. Preferably the definition is displayed in another window. For this the preview window can be used. To open a preview window to display the function "write_char": >
es_es: Cuando edita código que contiene una llamada a una función, necesitará los argumentos correctos. Para conocer los valores que puede introducir, puede ver cómo se define la función. El mecanismo de etiquetas es adecuado para esto. Preferentemente, la definición se muestra en otra ventana. Puede usar la ventana de previsualización para esto. Use lo siguiente para abrir una ventana de previsualización que muestre la función «write_char»: >

source: Vim will open a window, and jumps to the tag "write_char". Then it takes you back to the original position. Thus you can continue typing without the need to use a CTRL-W command. If the name of a function appears in the text, you can get its definition in the preview window with: >
es_es: Vim abrirá una ventana, y saltará a la etiqueta «write_char». A continuación, vuelve a la posición original. Así, puede seguir escribiendo sin necesidad de usar la orden «CTRL-W». Si el nombre de una función aparece en el texto, puede obtener su definición en la ventana de previsualización con lo siguiente: >

source: There is a script that automatically displays the text where the word under the cursor was defined. See |CursorHold-example|.
es_es: Hay un script que muestra el texto automáticamente dónde se definió la palabra bajo el cursor. Consulte |CursorHold-example|.

source: To edit a specific file in the preview window, use ":pedit". This can be useful to edit a header file, for example: >
es_es: Para editar un fichero específico en la ventana de previsualización, use «_pedit». Esto puede ser útil para editar la cabecera de un archivo, por ejemplo: >

source: Finally, ":psearch" can be used to find a word in the current file and any included files and display the match in the preview window. This is especially useful when using library functions, for which you do not have a tags file. Example: >
es_es: Por último, «:psearch» se puede utilizar para buscar una palabra en el archivo actual y cualquier archivo incluido («include») y mostrar la coincidencia en la ventana de previsualización. Esto es especialmente útil cuando se utilizan las funciones de la biblioteca para el que no tiene un archivo de etiquetas. Ejemplo: >

source: *29.3* Moving through a program
es_es: *29.3* Moverse a través de un programa

source: Since a program is structured, Vim can recognize items in it. Specific commands can be used to move around. C programs often contain constructs like this:
es_es: Debido a que un programa está estructurado, Vim puede reconocer elementos en él. Puede usar órdenes específicas para desplazarse. Los programas en C habitualmente contienen construcciones como esta:

source: But then much longer, and possibly nested. Position the cursor on the "#ifdef" and press %. Vim will jump to the "#else". Pressing % again takes you to the "#endif". Another % takes you to the "#ifdef" again. When the construct is nested, Vim will find the matching items. This is a good way to check if you didn't forget an "#endif". When you are somewhere inside a "#if" - "#endif", you can jump to the start of it with: >
es_es: Pero también más largo, y posiblemente anidado. Posicione el cursor sobre «#ifdef» y pulse «%». Vim saltará al siguiente «#else». Pulsar «%» otra vez le devuelve a «#endif». Otro «%» le llevaría a «#ifdef» otra vez. Cuando una construcción está anidada, Vim encontrará los elementos coincidentes. Esta es una buena forma de comprobar si se ha olvidado de insertar un «#endif». Cuando está en algún punto dentro de un «#if - #endif», puede saltar al principio con lo siguiente: >

source: If you are not after a "#if" or "#ifdef" Vim will beep. To jump forward to the next "#else" or "#endif" use: >
es_es: Si no está después de un «#if» o «#ifdef» Vim emitirá un sonido. Para saltar hacia adelante al siguiente «#else» o «#endif» use lo siguiente: >

source: These two commands skip any "#if" - "#endif" blocks that they encounter. Example:
es_es: Estas dos órdenes omiten cualquier bloque «#if - #endif» que se encuentran. Ejemplo:

source: With the cursor in the last line, "[#" moves to the first line. The "#ifdef" - "#endif" block in the middle is skipped.
es_es: Con el cursor en la última línea, «[#» le lleva a la primera línea. El bloque «#ifdef - #endif» en el centro se omite.

source: In C code blocks are enclosed in {}. These can get pretty long. To move to the start of the outer block use the "[[" command. Use "][" to find the end. This assumes that the "{" and "}" are in the first column. The "[{" command moves to the start of the current block. It skips over pairs of {} at the same level. "]}" jumps to the end. An overview:
es_es: Los bloques de código C están limitados por {}. Esto puede ser muy largo. Para saltar al principio del bloque exterior use la orden «[[». Use «][» para encontrar el final. Esto supone que «{» y «}» están en la primera columna. La orden «[{» le lleva al principio del bloque actual. Omite las parejas de «{}» en el mismo nivel. «]}» salta al final. Una vista general:

source: When writing C++ or Java, the outer {} block is for the class. The next level of {} is for a method. When somewhere inside a class use "[m" to find the previous start of a method. "]m" finds the next start of a method.
es_es: Al escribir en C++ o Java, el bloque exterior «{}» es para la clase. El siguiente nivel de «{}» es para un método. Si se encuentra dentro de una clase, use «[m» para encontrar el inicio previo de un método. «]m» encuentra el siguiente inicio de un método.

source: Additionally, "[]" moves backward to the end of a function and "]]" moves forward to the start of the next function. The end of a function is defined by a "}" in the first column.
es_es: Además, «[]» se mueve hacia atrás al final de la función, y «]]» se mueve hacia adelante, al inicio de la siguiente función. El final de la función está definido con un «}» al principio de la primera columna.

source: Don't forget you can also use "%" to move between matching (), {} and []. That also works when they are many lines apart.
es_es: No se olvido de que también puede usar «%» para desplazarase entre parejas de «()», «{}» y «[]». También funciona cuando están separados por varias líneas.

source: The "[(" and "])" commands work similar to "[{" and "]}", except that they work on () pairs instead of {} pairs. > [( < <-------------------------------- <------- if (a == b && (c == d || (e > f)) && x > y) ~ --------------> --------------------------------> > ])
es_es: Las órdenes «[(» y «])» funcionan de manera similar a «[{» y «]}», con la excepción de que funcionan con parejas de «()» en lugar de «{}». > [( < <-------------------------------- <------- if (a == b && (c == d || (e > f)) && x > y) ~ --------------> --------------------------------> > ])

source: To move back to the start of a comment use "[/". Move forward to the end of a comment with "]/". This only works for /* - */ comments.
es_es: Use «[/» para volver al principio de un comentario. Puede moverse hacia adelante al final de un comentario con «]/». Sólo funciona con comentarios /* - */.

source: +-> +-> /* | [/ | * A comment about --+ [/ | +-- * wonderful life. | ]/ | */ <-+ | +-- foo = bar * 3; --+ | ]/ /* a short comment */ <-+
es_es: +-> +-> /* | [/ | * Comentario sobre la --+ [/ | +-- * maravillosa vida. | ]/ | */ <-+ | +-- foo = bar * 3; --+ | ]/ /* Comentario corto */ <-+

source: *29.4* Finding global identifiers
es_es: *29.4* Buscar identificadores globales

source: Vim will list the matching lines it can find. Not only in the current file, but also in all included files (and files included in them, etc.). The result looks like this:
es_es: VIM enumerará las líneas coincidentes que puede encontrar. No sólo en el archivo actual, sino también en todos los archivos incluidos (y archivos incluidos en ellos, etc..). El resultado tiene el siguiente aspecto:

source: Vim will find included files in the places specified with the 'path' option. If a directory is missing, some include files will not be found. You can discover this with this command: >
es_es: Vim encontrará ficheros incluidos en los lugares definidos con la opción 'path'. Si falta un directorio puede que no se encuentren todos los archivos incluidos. Puede descubrirlo con la siguiente orden: >

source: It will list the include files that could not be found. Also files included by the files that could be found. An example of the output:
es_es: Esto lista todos los archivos incluidos que no pudo encontrar. También incluye archivos incluidos por los ficheros no encontrados. Un ejemplo de la salida:

source: The "io.h" file is included by the current file and can't be found. "vim.h" can be found, thus ":checkpath" goes into this file and checks what it includes. The "functions.h" and "clib/exec_protos.h" files, included by "vim.h" are not found.
es_es: El archivo «io.h» está incluido en el archivo actual y no se puede encontrar. Se puede encontrar «vim.h», y por ello «:checkpath» acude a ese archivo y compruebe qué incluye. Los archivos «functions.h» y «clib/exec_protos.h», incluidos por «vim.h» no se pueden encontrar.

source: Note: Vim is not a compiler. It does not recognize "#ifdef" statements. This means every "#include" statement is used, also when it comes after "#if NEVER".
es_es: Nota: Vim no es un compilador. No reconoce las declaraciones «#ifdef». Esto significa que se usa cada declaración «#include», incluso si aparece después de «#if NEVER».

source: To fix the files that could not be found, add a directory to the 'path' option. A good place to find out about this is the Makefile. Look out for lines that contain "-I" items, like "-I/usr/local/X11". To add this directory use: >
es_es: Para arreglar los archivo no encontrados, añada el directorio a la opción 'path'. Un buen sitio para averiguar esto es el archivo «Makefile». Busque líneas que contengan elementos «-I», como «-I/usr/local/X11». Use los siguiente para añadir este directorio: >

source: When there are many subdirectories, you can use the "*" wildcard. Example: >
es_es: Puede usar el comodín «*» cuando haya varios directorios. Ejemplo: >

source: When working on a project with a whole nested tree of included files, the "**" items is useful. This will search down in all subdirectories. Example: >
es_es: Los elementos «**» son de utilidad cuando trabaja en un proyecto con un árblo anidado de archivos incluidos. Esto busca en todos los subdirectorios. Ejemplo: >

source: There are even more possibilities. Check out the 'path' option for info. If you want to see which included files are actually found, use this command: >
es_es: Hay incluso más posibilidades. Para más información consulte la opción 'path'. Use la siguiente orden si desea ver qué archivos incluidos se encontraron: >

source: You will get a (very long) list of included files, the files they include, and so on. To shorten the list a bit, Vim shows "(Already listed)" for files that were found before and doesn't list the included files in there again.
es_es: Obtendrá un lista muy larga de los archivos incluidos, los que éstos incluyen, y así sucesivamente. Para acortar la lista Vim muestra «Ya está listado» para los archivos encontrados anteriormente, y no muestra los ficheros incluidos nuevamente.

source: "[I" produces a list with only one line of text. When you want to have a closer look at the first item, you can jump to that line with the command: >
es_es: «[I» produce una lista con una sola línea de texto. Cuando desee ver el primer elemento, salte a esa línea con la siguiente orden: >

source: The list that "[I" produces has a number at the start of each line. When you want to jump to another item than the first one, type the number first: >
es_es: La lista que «[I» produce tiene un número al principio de la línea. Cuando desee saltar a otro elemento distinto al primero, primero introduzca el número:

source: Will jump to the third item in the list. Remember that you can use CTRL-O to jump back to where you started from.
es_es: Esto salta al tercer elemento de la lista. Recuerde que puede usar «CTRL-O» para volver al punto desde donde empezó.

source: [i only lists the first match ]I only lists items below the cursor ]i only lists the first item below the cursor
es_es: [i Lista sólo la primera coincidencia ]I Lista sólo elementos bajo el cursor ]i Lista sólo el primer elemento bajo el cursor
